[
  {
    "serviceName": "AUDIT & INSURANCE",
    "description": "FINACT provides a wide range of audit and assurance services to help improve your financial efficiency, accuracy and stability. Our Audit & Assurance Department strives to ensure that Audit is conducted with the highest standards & auditing procedures to ensure total compliance of client’s requirements. Types of Audits conducted Concurrent Audits. Revenue Audit of Banks. Branch Audits of Banks. Audit of PF Trusts, Charitable Trusts, Schools, etc. Audit of Co-operative Socities. Information System Audit Internal Audit Management Audit Special Audit Operations and efficiency audit services Due Diligence Review Related Business Advisory Services Risk Assessments Process Review Internal Financial Control Documentation and Testing Standard Operating procedure development Fraud and Forensic Audit Management and Operational Audit",
    "tags": ["audit", "insurance"]
  },
  {
    "serviceName": "ACCOUNT OUTSOURCING",
    "description": "Entrepreneurial businesses often reach a point where they need accounting oversight and someone to take on the burden of daily accounting tasks, so that they can concentrate on their more valuable and specialized areas of business. When you reach that point, outsourced accounting services can give you back your time and help you make informed decisions. We, at FINACT, possess the necessary expertise and relevant resources required to provide cost effective and high quality Accounting and Business Process Outsourcing services. Such outsourcing of non-critical allows our clients to concentrate and invest resources in their core business, by freeing up their valuable management time. Services Offered by us includes- Accounting System Design & Implementation Data Entry Financial Accounting Fixed Asset Accounting Management Accounts Payable Processing Accounts Receivable Processing Accounts Reconciliations, etc.",
    "tags": ["account", "outsourcing"]
  },
  {
    "serviceName": "ACCOUNTING AND FINANCIAL REPORTING",
    "description": "FINACT specializes in Financial Accounting and Reporting Services. Our talented team of trusted professionals have extensive knowledge of relevant financial reporting standards including generally accepted accounting principles (GAAP), international financial reporting standards (IFRS), and industry-specific reporting and disclosure rules. We helps clients address, mitigate and minimize future issues related to improper accounting or financial reporting, ranging from revenue recognition to loss reserves, to disclosures. We have also developed efficient systems to support the needs of clients by providing accurate, timely and informed financial reporting and management services in a professional and cost effective manner. We endeavor to become an integral part of your management team as an effective leader of the finance and accounting function. In continuation to above, our services includes following- Financial Reporting Monthly Profitability Reporting Financial Analysis Budgeting Debtor Creditor Ageing Analysis Production Analysis Cash Flow and Fund Flow position Others, client specific customized reports.",
    "tags": ["finance", "reporting"]
  },
  {
    "serviceName": "DIRECT TAXATION",
    "description": "The Indian Taxation system has undergone several reforms, challenging business Nationally and Internationally. Direct tax is an important part of the Indian tax structure affecting diverse persons including individuals, corporates, partnerships and others. In today’s world corporate as well as individuals are required to comply with a number of income tax compliances, which require expert knowledge and are mostly time-bound and technical in nature. Moreover, most of the income tax compliances nowadays are required to be completed online and require specialised knowledge and expertise. FINACT specializes in providing Time-bound and quality Income Tax services to our clients. Our Taxation vertical offers a wide range of expert innovative services in domestic taxation and international taxation that aim at value creation following best business practices. Our team of expert professionals interact with clients to evolve tax efficient solutions, while at the same time recognizing that compliance & risk mitigation is a key parameter in any planning From consultancy to appeal before tax authorities we provide the following services as below: Corporate and personal tax statutory compliances including income-tax assessments, Representations & Litigation Support including assessments & appeals International Taxation & Transfer Pricing International and Domestic Tax Planning & Advisory Filing of Income-tax, Tax deducted at Source (TDS) and Wealth-tax returns of residents and non-residents individuals, domestic and foreign companies and other entities. Designing tax efficient salary structures for employees. Assisting clients in taking most effective Tax positions and planning Tax outflows.",
    "tags": ["direct", "taxation"]
  },
  {
    "serviceName": "INDIRECT TAXATION",
    "description": "Our Indirect Tax Service offerings are tailored to assist companies, partnerships, individuals & others in meeting their indirect tax challenges. Our Services include analysis of the client’s business and to advise and assist them regarding their rates and applications under indirect taxes and for proper planning and management related to it.",
    "tags": ["indirect", "taxation"]
  },
  {
    "serviceName": "GST",
    "description": "GST (Goods & Service Tax) is a recently introduced concept which merges most indirect taxes under one umbrella tax. GST is a welcome step towards reducing compliances and for improving ease of doing business. Implementation of GST in India impact the Tax Structure, Tax Incidence, Tax Computation, Tax Payment, Compliance, Credit Utilization and Reporting, leading to a complete overhaul of the current indirect tax system. It’s important that all the taxpayers understand the implications as they explore their opportunities and business decisions. FINACT provides whole gamut of GST Services. Our professionals stay abreast with the frequent changes in the tax environment providing expert solutions. Here is an indicative glimpse of services we offer in this area : Migration of existing assesses under GST Registration of new dealers under GST Assistance for Impact analysis to assess the operational, commercial and financial impact of GST Support on Compliance with filings and records as required under the GST regime. GST Returns Filling as may comprehensively be required Presenting regular updates on GST Law & clarifications provided by Government on GST GST Advisory Services , etc. International Tax Planning & Advisory Providing on-call advisory services on specific GST queries raised by the clients from time to time.",
    "tags": ["gst", "banking"]
  },
  {
    "serviceName": "CORPORATE GOVERNANCE & SECRETARIAL PRACTICE",
    "description": "Corporate law today is a complex piece of legislation that governs the activities of not only domestic companies but also that of foreign companies setting up shop in India. At every step, corporates have to comply with the plethora of provisions contained in Indian Companies Act and in case of listed companies SEBI Regulations with Indian Companies Act At FINACT we are having highly qualified, innovative and experienced team which includes Company Secretaries, Lawyers, Chartered Accountants and MBAs. FINACT not only provides advice on ensuring compliance with these regulations but also provides secretarial support with respect to incorporation of Companies/Subsidiaries anywhere in India. Our services under this includes- Setting up Liaison Offices, Branch Offices and Project Offices Designing corporate structures for specific businesses, new projects and expansions by ensuring effective management of Local laws regarding Tax efficiency, Corporate laws, Foreign Exchange Management regulations and Confidentiality Advising on various matters under the Companies Law including appearance before the Company Law Board. Assisting in Winding-up of companies/striking off the name from the Registrar of Companies under the Act. Maintenance of statutory records registers and minutes books Assistance in preparation and filing of various returns and forms with the Registrar of Companies Drafting and maintenance of minutes of Board and Shareholders meeting, Maintenance of statutory records and registers Other than above, Our team expertise also covers legal & commercial advice and support on matters including: MSME listing RERA Insolvency Code Foreign Direct Investment FEMA",
    "tags": ["corporate", "governance", "secreterial", "practice"]
  },
  {
    "serviceName": "WEALTH MANAGEMENT & ADVISORY",
    "description": "FINACT is having a dedicated team of professionals serving the financial planning and wealth management needs of individuals, families, and businesses. Our mission is to help clients make good financial decisions by taking the time to learn what is important to them financially while providing our unbiased, straightforward advice to help them address their goals. Our commitment to this mission is defined by three core principles: Our following strengths help our clients recognize the advantages of taking advisory services on portfolio management, trust administration and investment advisory from us: In-depth discovery and active listening helps us understand what is truly important to each client A personalized strategy is developed that illustrates where clients stand today along with guidance for the future Clear recommendations that are designed to simplify the complex and help ease decision-making A hands-on investment approach focused on managing risk that helps provide solutions tied to each clients’ unique circumstance An experienced staff that delivers high levels of accessibility, responsiveness, and follow-through Ongoing dialogue and advice helps keep clients on track to reach their goals and allows for flexibility as their needs change Transparency and taking an active interest in clients’ lives helps build comfort and trust",
    "tags": ["wealth", "managemnet", "advisory"]
  }
]
